Revit 2026 API

# IFCProductWrapperAddAnnotation Method

---

Adds an annotation handle to associate with the IfcProduct in this wrapper.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddAnnotation(
	IFCAnyHandle annoHnd,
	IFCLevelInfo levelInfo,
	bool relateToLevel
)
```
```vb
Public Sub AddAnnotation (
	annoHnd As IFCAnyHandle,
	levelInfo As IFCLevelInfo,
	relateToLevel As Boolean
)
```
```cpp
public:
void AddAnnotation(
	IFCAnyHandle^ annoHnd,
	IFCLevelInfo^ levelInfo,
	bool relateToLevel
)
```
```fsharp
member AddAnnotation :
        annoHnd : IFCAnyHandle *
        levelInfo : IFCLevelInfo *
        relateToLevel : bool -> unit
```

#### Parameters

annoHnd IFCAnyHandle
     The annotation handle.
levelInfo IFCLevelInfo
     Information on the associated level. Optional, can be .
relateToLevel Boolean
     True to relate the annotation to the level, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.

#### Reference

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace